###############################################################################
# Created by write_sdc
###############################################################################
current_design aes_core
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name core_clock -period 20.0000 [get_ports {clk}]
set_propagated_clock [get_clocks {core_clock}]
###############################################################################
# Environment
###############################################################################
###############################################################################
# Design Rules
###############################################################################
